Enums/упВидыПолучателейСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыПолучателейСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоЗаказчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспедитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыДействийСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыДействийСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаданияНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиНаОтправкуФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаявкиНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПодтвержденияЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПредложенияПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПрохождениеТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьСобытияМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьФактическихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеМаршрутаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРаботПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаданияНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭкипажаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисоединениеФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыПолучателейСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТипИсходногоДействия = Неопределено;
	Если Параметры.Отбор.Свойство("ТипИсходногоДействия", ТипИсходногоДействия) Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокСсылок = Новый СписокЗначений;
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Пользователь);
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.ГруппаПользователей);	
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Строка);
		Если ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьРейса")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаРейса")  Тогда
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаданияНаПеревозкуГруза") 
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаданияНаПеревозку")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаявкиНаПеревозкуГруза")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаПеревозку") Тогда				
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПрохождениеТочки") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПодтвержденияЗаявкиНаТС") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаТС") Тогда 	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПредложенияПеревозчика") Тогда 
			//СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			//СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПутевогоЛиста")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьСобытияМониторинга") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеМаршрутаПоРейсу")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеРаботПоРейсу")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеЭкипажаПоРейсу") Тогда 
			
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			
		КонецЕсли;
		
		ДанныеВыбора = СписокСсылок;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
